Revit 2027 API
BuildingPad.HostId Property
 The element id of the topography surface hosting this BuidlingPad.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId HostId { get; }
Public ReadOnly Property HostId As ElementId
	Get
public:
property ElementId^ HostId {
	ElementId^ get ();
}
member HostId : ElementId with get
Property Value
ElementId
See Also
Reference
BuildingPad Class
Autodesk.Revit.DB.Architecture Namespace